// Благозвучни Думи
// Слончето Лони познава вече гласните и съгласните букви. Гласни са следните английски букви: a, e, i, o, u, y.
// То смята, че една дума е благозвучна, само ако броят на гласните букви е равен на броя на съгласните.
// Слончето е написало на един лист четирибуквени думи и иска да определи кои са благозвучни. Напишете програма vowel,
// която по дадена четиривуквена дума определя дали тя е благозвучна.
// Вход
// Вашата програма прочита от първия ред на стандартния вход дума, съставена от четири малки английски букви.
// Изход
// На един ред на стандартния изход вашата програма трябва да изведе думата Yes, ако въведената дума е благозвучна.
// Ако въведената дума не е благозвучна, програмата извежда на един ред, разделени с интервал броя на гласните и броя на съгласните букви.
const input = ['baaa'];
const print = this.print || console.log;
const gets = this.gets || ((arr, index) => () => arr[index++])(input, 0);
const word = gets();
let vowelCounter = 0;
let consonantCounter = 0;
for (let i = 0; i < word.length; i++) {
  if (word[i] === 'a' || word[i] === 'e' || word[i] === 'i' || word[i] === 'o' || word[i] === 'u' || word[i] === 'y') {
    vowelCounter++;
  } else consonantCounter++;
}
print(vowelCounter === consonantCounter ? 'Yes' : (`${vowelCounter} ${consonantCounter}`));
