// Добри числа
// Иванчо нарича едно число добро, ако то се дели на всяка негова цифра различна от 0.
// Например: - 13 не е добро - не се дели на 3 - 36 е добро - дели се на 3 и на 6 - 102 e добро - дели се на 1 и на 2 - 103 не е добро - не се дели на 3
// Помогнете на Иванчо като напишете програма, която намира броя на всички добри числа между дадени A и B (включително).
// Вход
// От първия ред се въвеждат числата A и B.
// Изход
// Изведете броя на добрите числа на единствен ред.
// Ограничения
// 1 <= A <= B <= 100000
const input = ['13', '204'];
const print = this.print || console.log;
const gets = this.gets || ((arr, index) => () => arr[index++])(input, 0);
// всички числа от 1 до 12 са добри, защото се делят на себе си (от 1 до 9), 10 и 11 се делят на 1, 12 се дели на 1 и 2
const a = gets();
// const b = gets();
for (let i = 0; i < a.length; i++) {
  if (Number.parseInt(a) % (Number.parseInt(a[i])) === 0) {
    continue;
  }
}
print(a);
