// Награда
// Директорът на училище „Мъчилище” решил да награди всички четвъртокласници и петокласници с толкова звездички, колкото отлични срочни оценки има всеки един от тях. Всеки ученик изучава по време на срока седем учебни предмета и се очаква да получи в края на срока седем срочни оценки. Но в „Мъчилище” не е никак лесно да се получи награда, защото директорът решил, че награден ще бъде само този ученик, който няма нито една слаба срочна оценка. Съставете програма prize, която ще помогне на училищната управа да прецени вярно и бързо дали даден ученик заслужава награда и какъв е размерът ú.
// Вход
// На първия ред на стандартния вход се въвеждат седем цели числа, разделени с интервал, задаващи седемте срочни оценки на един ученик.
// Изход
// Програмата извежда на единствен ред на стандартния изход No, ако ученикът не заслужава награда, а ако заслужава- толкова на брой звездички, колкото отлични срочни оценки има.
// Ограничения
// 2<= срочна оценка <=6
// Примерни тестове
// Вход
// 6 3 4 5 6 6 2
// Изход
// No
// Вход
// 6 3 4 5 6 6 6
// Изход
// ****
const input = ['6 6 6 6 6 6 2'];
const print = this.print || console.log;
const gets = this.gets || ((arr, index) => () => arr[index++])(input, 0);
const initialInput = gets().split(' ').sort().map(Number);
let prize = '';
if ((initialInput[0] === 2) || (initialInput[6] < 6)) {
  prize = 'No';
} else {
  for (let i = 0; i < 7; i++) {
    if (initialInput[i] === 6) {
      prize += '*';
    }
  }
}
print(prize);
